$ swipl
Welcome to SWI-Prolog (threaded, 64 bits, version 8.4.1)
SWI-Prolog comes with ABSOLUTELY NO WARRANTY. This is free software.
Please run ?- license. for legal details.

For online help and background, visit https://www.swi-prolog.org
For built-in help, use ?- help(Topic). or ?- apropos(Word).

?- [factorial].
true.

?- factorial(0, F).
F = 1 .

?- factorial(2, F).
F = 2 .

?- factorial(3, F).
F = 6 .

?- factorial(5, F).
F = 120 .
